### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

1. read_csv(): This function is used to read a CSV (comma-separated values) file and create a DataFrame from it.

In [2]:
df = pd.read_csv("people-1000000.csv")

2. head(): This functions displays the top 5 rows. If a argement is passed as integer, this will display those number of records

In [4]:
df.head()

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,9E39Bfc4fdcc44e,Diamond,Dudley,Male,teresa26@example.org,922.460.8218x66252,1945-12-06,Photographer
1,2,32C079F2Bad7e6F,Ethan,Hanson,Female,ufrank@example.com,(458)005-8931x2478,1985-03-08,Actuary
2,3,a1F7faeBf5f7A3a,Grace,Huerta,Female,tiffany51@example.com,(720)205-4521x7811,1941-01-21,Visual merchandiser
3,4,c7Dd389CA514dce,Jillian,Bryant,Female,parkerstone@example.net,453-499-3870x793,1933-01-17,"Embryologist, clinical"
4,5,eb3Dae1D4cd0A35,Warren,Simpson,Male,ryanmisty@example.com,958-772-8268x47673,2003-05-02,Armed forces training and education officer

3. tail() : This functions displays the bottom 5 rows. If a argement is passed as integer, this will display those number of records

In [5]:
df.tail(7)

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
999993,999994,A58E9CBea80edB6,Desiree,Navarro,Female,johnsonwarren@example.com,001-441-754-7387x9788,1953-03-21,Community development worker
999994,999995,5eC9C9E6Cb300A6,Tina,Schneider,Male,kwilkerson@example.com,+1-898-865-1963x749,2006-10-22,Chief Technology Officer
999995,999996,3080fe8e2Cf298d,Louis,Morrow,Male,atkinsjody@example.com,544-586-1666x446,1979-12-08,Building services engineer
999996,999997,1Dc832dBc54cc0c,Brittney,Gillespie,Female,helenbray@example.org,860.931.6256x86403,1947-08-16,Senior tax professional/tax inspector
999997,999998,ad0dEfAf71D90Ff,Cory,Collins,Male,vernonleblanc@example.com,001-877-079-9583x9181,2006-01-23,"Optician, dispensing"
999998,999999,BaaABECa3B0b7b9,Edward,Ramirez,Male,kgomez@example.net,+1-899-782-9850x80883,1940-10-19,Acupuncturist
999999,1000000,eBAadbbEBaeec20,Katrina,Cobb,Male,harrellfrederick@example.net,(622)120-4726x613,1917-12-07,Site engineer

4. value_counts(): This function is used to count the number of occurrences of each unique value in a column of a DataFrame.

In [6]:
df["Sex"].value_counts()

Male      500234
Female    499766
Name: Sex, dtype: int64

5. dtypes(): This function displays the data type of the columns

In [16]:
df.dtypes

Index             int64
User Id          object
First Name       object
Last Name        object
Sex              object
Email            object
Phone            object
Date of birth    object
Job Title        object
dtype: object

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [18]:

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

print(df)
new_index = pd.Index(range(1, len(df)*2, 2))
df.index = new_index


print(df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9
   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [20]:
df = pd.DataFrame({'Values':[10,20,30,40,50]})
sum = df['Values'][0:3].sum()
print(sum)

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [33]:
df = pd.DataFrame({'Text': ['Hello', 'my','name','is','Rohit']})
df['Word_Count']= df['Text'].apply(lambda x: len(str(x)))
print(df)

    Text  Word_Count
0  Hello           5
1     my           2
2   name           4
3     is           2
4  Rohit           5

### Q5. How are DataFrame.size() and DataFrame.shape() different?

The size and shape attributes are used to get information about the dimensions of a Pandas DataFrame.

The size attribute returns the total number of elements in the DataFrame. It is calculated as the product of the number of rows and the number of columns in the DataFrame.

The shape attribute returns a tuple that contains the number of rows and columns in the DataFrame, respectively.

In [35]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

size = df.size
shape = df.shape

print(f"DataFrame size: {size}")
print(f"DataFrame shape: {shape}")

DataFrame size: 9
DataFrame shape: (3, 3)

### Q6. Which function of pandas do we use to read an excel file?

we use pd.read_excel function to read an excel file

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
#### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain  john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [36]:
df = pd.DataFrame({'Email':['username@domain.com','username2@domain.com']})
df["username"] = df['Email'].str.split('@').str[0]
print(df)

                  Email   username
0   username@domain.com   username
1  username2@domain.com  username2

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B'  s less than 10. The function should return a new DataFrame that contains only the selected rows.

In [38]:
df = pd.DataFrame({'A':[3,8,6,2,9], 'B':[5,2,9,3,1], 'C':[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [43]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [47]:
df = pd.DataFrame({'Values':[10,20,30,40,50]})
mean = df['Values'].mean()
median = df['Values'].median()
std = df['Values'].std()
print(f"The Mean of the column is {mean}")
print(f"The Median of the column is {median}")
print(f"The Standard Deviation of the column is {std}")

The Mean of the column is 30.0
The Median of the column is 30.0
The Standard Deviation of the column is 15.811388300841896

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for  he past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [55]:
df = pd.DataFrame({'Sales':[100,200,300,400,500,600,700,800,900,1000,1100,1200], 'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-08','2023-01-09','2023-01-10','2023-01-11','2023-01-12','2023-01-15','2023-01-16']})
df['Date'] = pd.to_datetime(df['Date'])
df['Moving Average'] = df['Sales'].rolling(window = 7, min_periods=1).mean()
print(df)

    Sales       Date  Moving Average
0     100 2023-01-01           100.0
1     200 2023-01-02           150.0
2     300 2023-01-03           200.0
3     400 2023-01-04           250.0
4     500 2023-01-05           300.0
5     600 2023-01-08           350.0
6     700 2023-01-09           400.0
7     800 2023-01-10           500.0
8     900 2023-01-11           600.0
9    1000 2023-01-12           700.0
10   1100 2023-01-15           800.0
11   1200 2023-01-16           900.0

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [79]:
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-08','2023-01-09','2023-01-10','2023-01-11','2023-01-12','2023-01-15','2023-01-16']})
df['Date'] = pd.to_datetime(df['Date'])
df['Weekday'] = df['Date'].dt.strftime('%A')
print(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-08     Sunday
6  2023-01-09     Monday
7  2023-01-10    Tuesday
8  2023-01-11  Wednesday
9  2023-01-12   Thursday
10 2023-01-15     Sunday
11 2023-01-16     Monday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-11'.

In [88]:
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-08','2023-01-09','2023-01-10','2023-01-11','2023-01-12','2023-01-15','2023-01-16']})
df['Date'] = pd.to_datetime(df['Date'])
df1 = df[(df['Date']>'2023-01-02') & (df['Date']<'2023-01-11')]
print(df1)

        Date
2 2023-01-03
3 2023-01-04
4 2023-01-05
5 2023-01-08
6 2023-01-09
7 2023-01-10

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

#### The first and foremost necessary library that needs to be imported to use the basic functions of pandas is pandas itself.